app/controllers/passwords_controller.rb

    def update
        if Current.user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-09-28 00:13:41.203108"], ["id", 11]]