app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)  [["email", "a@a.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-09-30 03:22:22.892001"], ["updated_at", "2023-09-30 03:22:22.892001"], ["name", nil]]
---
    def create
        @user = User.new(user_params)
        if @user.save