app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def list
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]
---
    def destroy
        @user = User.find_by_id(params[:id])
        if @user.id == Current.user.id
            redirect_to users_path, alert: "You can't delete yourself."
        else
            @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ?, "name" = ? WHERE "users"."id" = ?  [["email", "bbb@bbb.com"], ["updated_at", "2023-10-07 22:11:59.653719"], ["name", "bbbb"], ["id", 25]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params)